; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v5 - type_2 ?v8 - type_3)
 	      (pred_4 ?v4 - object ?v8 - type_3)
	      (pred_1 ?v5 - type_2 ?v7 - type_1)
	      (pred_3 ?v5 - type_2 ?v4 - object ?v7 - type_1))

   (:action op_2
       :parameters  (?v5 - type_2 ?v3 ?v1 - type_3)
       :precondition (and  (pred_2 ?v5 ?v3))
       :effect (and  (pred_2 ?v5 ?v1)
		     (not (pred_2 ?v5 ?v3))))

   (:action op_1
       :parameters (?v5 - type_2 ?v2 - object ?v6 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v2 ?v6) (pred_2 ?v5 ?v6) (pred_1 ?v5 ?v7))
       :effect (and (pred_3 ?v5 ?v2 ?v7)
		    (not (pred_4 ?v2 ?v6)) 
		    (not (pred_1 ?v5 ?v7))))

   (:action op_3
       :parameters (?v5 - type_2 ?v2 - object ?v6 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_3 ?v5 ?v2 ?v7) (pred_2 ?v5 ?v6))
       :effect (and (pred_4 ?v2 ?v6)
		    (pred_1 ?v5 ?v7)
		    (not (pred_3 ?v5 ?v2 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_04 - type_2
obj_05 obj_12 obj_03 obj_10 - type_1
obj_01 obj_09 obj_14 obj_08 - type_3
obj_06 obj_02 obj_13 obj_07 - object)
(:init
(pred_2 obj_11 obj_09)
(pred_1 obj_11 obj_05)
(pred_1 obj_11 obj_12)
(pred_2 obj_04 obj_08)
(pred_1 obj_04 obj_03)
(pred_1 obj_04 obj_10)
(pred_4 obj_06 obj_09)
(pred_4 obj_02 obj_01)
(pred_4 obj_13 obj_09)
(pred_4 obj_07 obj_01)
)
(:goal
(and
(pred_4 obj_06 obj_08)
(pred_4 obj_02 obj_08)
(pred_4 obj_13 obj_01)
(pred_4 obj_07 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_11 obj_08) (pred_2 obj_04 obj_08))))
  )
)
)

; plan
1. (op_1 obj_11 obj_06 obj_09 obj_12)
   deleted: (pred_4 obj_06 obj_09) (pred_1 obj_11 obj_12)
   added: (pred_3 obj_11 obj_06 obj_12)
   goals met: 0 of 4
2. (op_1 obj_11 obj_13 obj_09 obj_05)
   deleted: (pred_4 obj_13 obj_09) (pred_1 obj_11 obj_05)
   added: (pred_3 obj_11 obj_13 obj_05)
   goals met: 0 of 4
3. (op_2 obj_04 obj_08 obj_01)
   deleted: (pred_2 obj_04 obj_08)
   added: (pred_2 obj_04 obj_01)
   goals met: 0 of 4
4. (op_2 obj_11 obj_09 obj_01)
   deleted: (pred_2 obj_11 obj_09)
   added: (pred_2 obj_11 obj_01)
   goals met: 0 of 4
5. (op_1 obj_04 obj_07 obj_01 obj_10)
   deleted: (pred_4 obj_07 obj_01) (pred_1 obj_04 obj_10)
   added: (pred_3 obj_04 obj_07 obj_10)
   goals met: 0 of 4
6. (op_3 obj_11 obj_13 obj_01 obj_05)
   deleted: (pred_3 obj_11 obj_13 obj_05)
   added: (pred_4 obj_13 obj_01) (pred_1 obj_11 obj_05)
   goals met: 1 of 4
7. (op_2 obj_04 obj_01 obj_08)
   deleted: (pred_2 obj_04 obj_01)
   added: (pred_2 obj_04 obj_08)
   goals met: 1 of 4
8. (op_1 obj_11 obj_02 obj_01 obj_05)
   deleted: (pred_4 obj_02 obj_01) (pred_1 obj_11 obj_05)
   added: (pred_3 obj_11 obj_02 obj_05)
   goals met: 1 of 4
9. (op_3 obj_04 obj_07 obj_08 obj_10)
   deleted: (pred_3 obj_04 obj_07 obj_10)
   added: (pred_4 obj_07 obj_08) (pred_1 obj_04 obj_10)
   goals met: 2 of 4
10. (op_2 obj_04 obj_08 obj_01)
   deleted: (pred_2 obj_04 obj_08)
   added: (pred_2 obj_04 obj_01)
   goals met: 2 of 4
11. (op_2 obj_11 obj_01 obj_08)
   deleted: (pred_2 obj_11 obj_01)
   added: (pred_2 obj_11 obj_08)
   goals met: 2 of 4
12. (op_3 obj_11 obj_02 obj_08 obj_05)
   deleted: (pred_3 obj_11 obj_02 obj_05)
   added: (pred_4 obj_02 obj_08) (pred_1 obj_11 obj_05)
   goals met: 3 of 4
13. (op_3 obj_11 obj_06 obj_08 obj_12)
   deleted: (pred_3 obj_11 obj_06 obj_12)
   added: (pred_4 obj_06 obj_08) (pred_1 obj_11 obj_12)
   goals met: 4 of 4
